# coding=utf-8


def Ejercicio1():
    print(" ")
    print("======================================= Ejercicio 1 ===================================================")
    casa = [["biblioteca", 11.25], ["cocina", 18.00], ["sala", 20.00], ["recamara", 10.75], ["bano", 9.5]]
    print(" ")
    print("=======================================================================================================")
    print(" ")
    return casa

def Ejercicio2(lista):
    lista[4][1] = 9.50
    print("======================================= Ejercicio 2 ===================================================")
    print(lista[::1])
    print("=======================================================================================================")
    print(" ")
    return lista

def Ejercicio3(lista):
    print("======================================= Ejercicio 3 ===================================================")
    nuevalista = []
    nuevalista = lista + [["psicina", 24.5], ["garage", 12.0]]
    print(nuevalista[::1])
    print("=======================================================================================================")
    print(" ")
    return nuevalista

def Ejercicio4(lista):
    print("======================================= Ejercicio 4 ===================================================")
    del(lista[5])
    print(lista[::1])
    print("=======================================================================================================")

def Ejercicio5():
    print(" ")
    print("======================================= Ejercicio 5 ===================================================")
    x = int(input("Pon el número: "))
    lista = []

    for i in range(1, x+1):
        a = x%i
        if(a == 0):
            lista.append(i)
        
    print(lista[::1])
    

def main():
    Ejercicio4(Ejercicio3(Ejercicio2(Ejercicio1())))
    Ejercicio5()




main()